using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_002_DataTypes
{
    class Program
    {
        static void Main(string[] args)
        {
            // В зависимости от того, какие данные нужно хранить, есть несколько видов "контейнеров"
            // или типов данных.
            // В C# есть 
            /// Числовые типы 
            /// Целые числа со знаком: -352, -17, 0, 4
            /// Целые числа без знака: 0, 1, 2, 2000, 7985
            /// Вещественные числа: -9.03, 3.2019, 3.1415
            //
            /// Строковый
            /// Любая строка записывается в двойных ковычках - "пример"
            /// 
            // 
            /// Символьный 
            /// Переменная символьного типа записывается в одинарных ковычках - ''
            //
            /// Логический
            /// Переменная логического типа принимает два возможных значения
            ///   истина - true
            ///   ложь - false

        }
    }
}
