using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_006
{
    class Program
    {
        static void Main(string[] args)
        {
            // Пример 6.
            // Заказчик прочит вас написать игру "Угадай-ка", в которой
            // игрок должен угадать число из диапазона от 1 до 100 
            // за минимальное количество шагов.
            // При этом, после очередной попытки, игрок должен видеть сообщение
            // "Введенное число больше загаданного. Попробуйте ещё раз"
            // "Введенное число меньше загаданного. Попробуйте ещё раз"
            // или "Поздравляю, число угадано! Число попыток: {число}.
        }
    }
}
