using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_000_Loops
{
    class Program
    {
        static void Main(string[] args)
        {
            // В C# есть три+одна циклическая конструкция (оператор). 
            // Они используются для выполнения определенной 
            // последовательности действий несколько раз.

            // Цикл — разновидность управляющей конструкции, 
            // предназначенная для организации многократного исполнения набора инструкций.

            // Блок исполняемых инструкций называется телом цикла
            // Одно исполнение набора инструкций называют итерацией цикла

        }
    }
}
