using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_004_Array2D
{
    class Program
    {
        static void Main(string[] args)
        {
            // 4. Двумерные массивы: использование, задание

            // int[] collection = new int[3];
            //// ┌───────────────────────────────────────────┐
            //// │    ┌────────┐   ┌────────┐   ┌────────┐   │
            //// │    │   31   │   │   12   │   │  1771  │   │
            //// │    └────────┘   └────────┘   └────────┘   │
            //// │         0            1           2        │
            //// └───────────────────────────────────────────┘

            ////         0     1     2     3
            ////     ┌─────────────────────────┐
            ////     │ ┌───┐ ┌───┐ ┌───┐ ┌───┐ │
            ////  0  │ │ 1 │ │ 3 │ │ 0 │ │ 1 │ │
            ////     │ └───┘ └───┘ └───┘ └───┘ │
            ////     │ ┌───┐ ┌───┐ ┌───┐ ┌───┐ │
            ////  1  │ │ 1 │ │ 0 │ │ 3 │ │ 1 │ │
            ////     │ └───┘ └───┘ └───┘ └───┘ │
            ////     │ ┌───┐ ┌───┐ ┌───┐ ┌───┐ │
            ////  2  │ │ 2 │ │ 0 │ │ 1 │ │ 9 │ │
            ////     │ └───┘ └───┘ └───┘ └───┘ │
            ////     └─────────────────────────┘

            //

            int[,] matrix = new int[3, 4]; // Задание двумерного массива, в котором 3 строки и 4 столбца

            matrix[1, 2] = 3;

            Random r = new Random();

            for (int i = 0; i < 3; i++)
            {
                for (int j = 0; j < 4; j++)
                {
                    matrix[i, j] = r.Next(10);
                    Console.Write($"{matrix[i, j]} ");
                }
                Console.WriteLine();
            }





        }
    }
}
