using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Example_002_Begin
{
    class Program
    {
        static void Main(string[] args)
        {
            // 2. Параметры методов, модификаторы параметров, возвращение значений
            //
            //
            // УровниДоступа МодификаторыДоступа ВозвращаемыйТип ИмяМетода(ПараметрыМетода)
            // {
            //    Тело метода
            // }
            //
            // УровниДоступа: [ private, public, protected, internal ]. 
            //   С помощью четырех модификаторов доступа можно объявить шесть уровней доступности.
            //
            // МодификаторыДоступа: static [ , abstract, async, extern, override, virtual ]
            //
            // ВозвращаемыйТип: int, double, string и т.д.
            //                  void если ничего возвращать не нужно
            // 
            // ИмяМетода: Строчные и прописные буквы латинского алфавита, цифры, _
            //            цифра не может быть на первом месте
            // 
            // ПараметрыМетода: аргументы, над которыми, как правило производятся какие-то действия
            //                  Формальные парамметры - параметры указанные при описании метода
            //                  Фактические параметры - параметры указанные при вызове метода


            // static ВозвращаемыйТип ИмяМетода(ПараметрыМетода)
            // {
            //    Тело метода
            // }
        }
    }
}
